light-136/GitCC/GD32驱动器/GD32固件烧录/GD32 All In One Programmer/OptionBytesXML/GD32A72x.xml
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<OPBytesBlocks>
	<OPBytesBlock baseAddress="0x1FFF8800" length="52" RegType="OptionBytes"/>
</OPBytesBlocks>
<Architectures>
    <Architecture type="0x0">
		<FlashSize Size="4096"/>
	</Architecture>
	<Architecture type="0x1">
		<FlashSize Size="2048"/>
	</Architecture>
	<Architecture type="0x2">
		<FlashSize Size="1024"/>
	</Architecture>
</Architectures>
<OPBytesArchitecture type = "0">
	<OPBytes baseAddress="0x1FFF8800" length="52" RegType="OptionBytes">
        <OPByte>
            <name>OB_SPC</name>
            <displayName>OB_SPC</displayName>
            <addressOffset>0x0</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xA5</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_SPC</name>
                    <brief>HOST option bytes security protection value</brief>
                    <description>HOST option bytes security protection value&#x000A;0xA5 : no security protection&#x000A;any value except 0xA5 or 0xCC : protection level low&#x000A;0xCC : protection level high</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_SPC_N</name>
            <displayName>OB_SPC_N</displayName>
            <addressOffset>0x1</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x5A</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_SPC_N</name>
                    <brief>OB_SPC complement value</brief>
                    <description>OB_SPC complement value</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER</name>
            <displayName>OB_USER</displayName>
            <addressOffset>0x2</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>nFWDG_DPSLP</name>
                    <brief>nFWDG_DPSLP</brief>
                    <description>nFWDG_DPSLP&#x000A;0: free watchdog 0 / 1 stop counting in deep-sleep mode&#x000A;1: free watchdog 0 / 1 continue counting in deep-sleep mode</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>nFWDG_STDBY</name>
                    <brief>nFWDG_STDBY</brief>
                    <description>nFWDG_STDBY&#x000A;0: free watchdog 0 / 1 stop counting in standby mode&#x000A;1: free watchdog 0 / 1 continue counting in standby mode</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>nFWDG1_HW</name>
                    <brief>nFWDG1_HW</brief>
                    <description>nFWDG1_HW&#x000A;0: hardware free watchdog 1&#x000A;1: software free watchdog 1</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>nRST_STDBY</name>
                    <brief>nRST_STDBY</brief>
                    <description>nRST_STDBY&#x000A;0: generate a reset instead of entering standby mode&#x000A;1: no reset when entering standby mode</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>nRST_DPSLP</name>
                    <brief>nRST_DPSLP</brief>
                    <description>nRST_DPSLP&#x000A;0: generate a reset instead of entering deep-sleep mode&#x000A;1: no reset when entering deep-sleep mode</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>nFWDG0_HW</name>
                    <brief>nFWDG0_HW</brief>
                    <description>nFWDG0_HW&#x000A;0: hardware free watchdog 0&#x000A;1: software free watchdog 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER_N</name>
            <displayName>OB_USER_N</displayName>
            <addressOffset>0x3</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER_N</name>
                    <brief>OB_USER complement value</brief>
                    <description>OB_USER complement value</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_DATA[7:0]</name>
            <displayName>OB_DATA[7:0]</displayName>
            <addressOffset>0x4</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_DATA[7:0]</name>
                    <brief>user defined data bit 7 to 0</brief>
                    <description>user defined data bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_DATA_N[7:0]</name>
            <displayName>OB_DATA_N[7:0]</displayName>
            <addressOffset>0x5</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_DATA_N[7:0]</name>
                    <brief>OB_DATA complement value bit 7 to 0</brief>
                    <description>OB_DATA complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_DATA[15:8]</name>
            <displayName>OB_DATA[15:8]</displayName>
            <addressOffset>0x6</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_DATA[15:8]</name>
                    <brief>user defined data bit 15 to 8</brief>
                    <description>user defined data bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_DATA_N[15:8]</name>
            <displayName>OB_DATA_N[15:8]</displayName>
            <addressOffset>0x7</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_DATA_N[15:8]</name>
                    <brief>OB_DATA complement value bit 15 to 8</brief>
                    <description>OB_DATA complement value bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP[7:0]</name>
            <displayName>OB_BK0WP[7:0]</displayName>
            <addressOffset>0x8</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK0WP[7]</name>
                    <brief>0x8070000~0x807FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 7(0x8070000~0x807FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[6]</name>
                    <brief>0x8060000~0x806FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 6(0x8060000~0x806FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[5]</name>
                    <brief>0x8050000~0x805FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 5(0x8050000~0x805FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[4]</name>
                    <brief>0x8040000~0x804FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 4(0x8040000~0x804FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[3]</name>
                    <brief>0x8030000~0x803FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 3(0x8030000~0x803FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[2]</name>
                    <brief>0x8020000~0x802FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 2(0x8020000~0x802FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[1]</name>
                    <brief>0x8010000~0x801FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 1(0x8010000~0x801FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[0]</name>
                    <brief>0x8000000~0x800FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 0(0x8000000~0x800FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP_N[7:0]</name>
            <displayName>OB_BK0WP_N[7:0]</displayName>
            <addressOffset>0x9</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK0WP_N[7:0]</name>
                    <brief>OB_BK0WP complement value bit 7 to 0</brief>
                    <description>OB_BK0WP complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP[15:8]</name>
            <displayName>OB_BK0WP[15:8]</displayName>
            <addressOffset>0xA</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK0WP[15]</name>
                    <brief>0x80F0000~0x80FFFFF</brief>
                    <description>Page erase / program protection of bank0 bit 15(0x80F0000~0x80FFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[14]</name>
                    <brief>0x80E0000~0x80EFFFF</brief>
                    <description>Page erase / program protection of bank0 bit 14(0x80E0000~0x80EFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[13]</name>
                    <brief>0x80D0000~0x80DFFFF</brief>
                    <description>Page erase / program protection of bank0 bit 13(0x80D0000~0x80DFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[12]</name>
                    <brief>0x80C0000~0x80CFFFF</brief>
                    <description>Page erase / program protection of bank0 bit 12(0x80C0000~0x80CFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[11]</name>
                    <brief>0x80B0000~0x80BFFFF</brief>
                    <description>Page erase / program protection of bank0 bit 11(0x80B0000~0x80BFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[10]</name>
                    <brief>0x80A0000~0x80AFFFF</brief>
                    <description>Page erase / program protection of bank0 bit 10(0x80A0000~0x80AFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[9]</name>
                    <brief>0x8090000~0x809FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 9(0x8090000~0x809FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[8]</name>
                    <brief>0x8080000~0x808FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 8(0x8080000~0x808FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP_N[15:8]</name>
            <displayName>OB_BK0WP_N[15:8]</displayName>
            <addressOffset>0xB</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK0WP_N[15:8]</name>
                    <brief>OB_BK0WP complement value bit 15 to 8</brief>
                    <description>OB_BK0WP complement value bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP[23:16]</name>
            <displayName>OB_BK0WP[23:16]</displayName>
            <addressOffset>0xC</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK0WP[23]</name>
                    <brief>0x8170000~0x817FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 23(0x8170000~0x817FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[22]</name>
                    <brief>0x8160000~0x816FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 22(0x8160000~0x816FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[21]</name>
                    <brief>0x8150000~0x815FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 21(0x8150000~0x815FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[20]</name>
                    <brief>0x8140000~0x814FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 20(0x8140000~0x814FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[19]</name>
                    <brief>0x8130000~0x813FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 19(0x8130000~0x813FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[18]</name>
                    <brief>0x8120000~0x812FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 18(0x8120000~0x812FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[17]</name>
                    <brief>0x8110000~0x811FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 17(0x8110000~0x811FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[16]</name>
                    <brief>0x8100000~0x810FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 16(0x8100000~0x810FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP_N[23:16]</name>
            <displayName>OB_BK0WP_N[23:16]</displayName>
            <addressOffset>0xD</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK0WP_N[23:16]</name>
                    <brief>OB_BK0WP complement value bit 23 to 16</brief>
                    <description>OB_BK0WP complement value bit 23 to 16</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP[31:24]</name>
            <displayName>OB_BK0WP[31:24]</displayName>
            <addressOffset>0xE</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK0WP[31]</name>
                    <brief>0x81F0000~0x81FFFFF</brief>
                    <description>Page erase / program protection of bank0 bit 31(0x81F0000~0x81FFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[30]</name>
                    <brief>0x81E0000~0x81EFFFF</brief>
                    <description>Page erase / program protection of bank0 bit 30(0x81E0000~0x81EFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[29]</name>
                    <brief>0x81D0000~0x81DFFFF</brief>
                    <description>Page erase / program protection of bank0 bit 29(0x81D0000~0x81DFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[28]</name>
                    <brief>0x81C0000~0x81CFFFF</brief>
                    <description>Page erase / program protection of bank0 bit 28(0x81C0000~0x81CFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[27]</name>
                    <brief>0x81B0000~0x81BFFFF</brief>
                    <description>Page erase / program protection of bank0 bit 27(0x81B0000~0x81BFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[26]</name>
                    <brief>0x81A0000~0x81AFFFF</brief>
                    <description>Page erase / program protection of bank0 bit 26(0x81A0000~0x81AFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[25]</name>
                    <brief>0x8190000~0x819FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 25(0x8190000~0x819FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
