light-136/GitCC/GD32驱动器/GD32固件烧录/GD32 All In One Programmer/OptionBytesXML/GD32A72x.xml
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[24]</name>
                    <brief>0x8180000~0x818FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 24(0x8180000~0x818FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP_N[31:24]</name>
            <displayName>OB_BK0WP_N[31:24]</displayName>
            <addressOffset>0xF</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK0WP_N[31:24]</name>
                    <brief>OB_BK0WP complement value bit 31 to 24</brief>
                    <description>OB_BK0WP complement value bit 31 to 24</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP[7:0]</name>
            <displayName>OB_BK1WP[7:0]</displayName>
            <addressOffset>0x10</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK1WP[7]</name>
                    <brief>0x8270000~0x827FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 7(0x8270000~0x827FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[6]</name>
                    <brief>0x8260000~0x826FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 6(0x8260000~0x826FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[5]</name>
                    <brief>0x8250000~0x825FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 5(0x8250000~0x825FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[4]</name>
                    <brief>0x8240000~0x824FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 4(0x8240000~0x824FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[3]</name>
                    <brief>0x8230000~0x823FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 3(0x8230000~0x823FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[2]</name>
                    <brief>0x8220000~0x822FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 2(0x8220000~0x822FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[1]</name>
                    <brief>0x8210000~0x821FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 1(0x8210000~0x821FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[0]</name>
                    <brief>0x8200000~0x820FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 0(0x8200000~0x820FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP_N[7:0]</name>
            <displayName>OB_BK1WP_N[7:0]</displayName>
            <addressOffset>0x11</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK1WP_N[7:0]</name>
                    <brief>OB_BK1WP complement value bit 7 to 0</brief>
                    <description>OB_BK1WP complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP[15:8]</name>
            <displayName>OB_BK1WP[15:8]</displayName>
            <addressOffset>0x12</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK1WP[15]</name>
                    <brief>0x82F0000~0x82FFFFF</brief>
                    <description>Page erase / program protection of bank1 bit 15(0x82F0000~0x82FFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[14]</name>
                    <brief>0x82E0000~0x82EFFFF</brief>
                    <description>Page erase / program protection of bank1 bit 14(0x82E0000~0x82EFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[13]</name>
                    <brief>0x82D0000~0x82DFFFF</brief>
                    <description>Page erase / program protection of bank1 bit 13(0x82D0000~0x82DFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[12]</name>
                    <brief>0x82C0000~0x82CFFFF</brief>
                    <description>Page erase / program protection of bank1 bit 12(0x82C0000~0x82CFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[11]</name>
                    <brief>0x82B0000~0x82BFFFF</brief>
                    <description>Page erase / program protection of bank1 bit 11(0x82B0000~0x82BFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[10]</name>
                    <brief>0x82A0000~0x82AFFFF</brief>
                    <description>Page erase / program protection of bank1 bit 10(0x82A0000~0x82AFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[9]</name>
                    <brief>0x8290000~0x829FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 9(0x8290000~0x829FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[8]</name>
                    <brief>0x8280000~0x828FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 8(0x8280000~0x828FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP_N[15:8]</name>
            <displayName>OB_BK1WP_N[15:8]</displayName>
            <addressOffset>0x13</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK1WP_N[15:8]</name>
                    <brief>OB_BK1WP complement value bit 15 to 8</brief>
                    <description>OB_BK1WP complement value bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP[23:16]</name>
            <displayName>OB_BK1WP[23:16]</displayName>
            <addressOffset>0x14</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK1WP[23]</name>
                    <brief>0x8370000~0x837FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 23(0x8370000~0x837FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[22]</name>
                    <brief>0x8360000~0x836FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 22(0x8360000~0x836FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[21]</name>
                    <brief>0x8350000~0x835FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 21(0x8350000~0x835FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[20]</name>
                    <brief>0x8340000~0x834FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 20(0x8340000~0x834FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[19]</name>
                    <brief>0x8330000~0x833FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 19(0x8330000~0x833FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[18]</name>
                    <brief>0x8320000~0x832FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 18(0x8320000~0x832FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[17]</name>
                    <brief>0x8310000~0x831FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 17(0x8310000~0x831FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[16]</name>
                    <brief>0x8300000~0x830FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 16(0x8300000~0x830FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP_N[23:16]</name>
            <displayName>OB_BK1WP_N[23:16]</displayName>
            <addressOffset>0x15</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK1WP_N[23:16]</name>
                    <brief>OB_BK1WP complement value bit 23 to 16</brief>
                    <description>OB_BK1WP complement value bit 23 to 16</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP[31:24]</name>
            <displayName>OB_BK1WP[31:24]</displayName>
            <addressOffset>0x16</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK1WP[31]</name>
                    <brief>0x83F0000~0x83FFFFF</brief>
                    <description>Page erase / program protection of bank1 bit 31(0x83F0000~0x83FFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[30]</name>
                    <brief>0x83E0000~0x83EFFFF</brief>
                    <description>Page erase / program protection of bank1 bit 30(0x83E0000~0x83EFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[29]</name>
                    <brief>0x83D0000~0x83DFFFF</brief>
                    <description>Page erase / program protection of bank1 bit 29(0x83D0000~0x83DFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[28]</name>
                    <brief>0x83C0000~0x83CFFFF</brief>
                    <description>Page erase / program protection of bank1 bit 28(0x83C0000~0x83CFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[27]</name>
                    <brief>0x83B0000~0x83BFFFF</brief>
                    <description>Page erase / program protection of bank1 bit 27(0x83B0000~0x83BFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[26]</name>
                    <brief>0x83A0000~0x83AFFFF</brief>
                    <description>Page erase / program protection of bank1 bit 26(0x83A0000~0x83AFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[25]</name>
                    <brief>0x8390000~0x839FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 25(0x8390000~0x839FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[24]</name>
                    <brief>0x8380000~0x838FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 24(0x8380000~0x838FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP_N[31:24]</name>
            <displayName>OB_BK1WP_N[31:24]</displayName>
            <addressOffset>0x17</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK1WP_N[31:24]</name>
                    <brief>OB_BK1WP complement value bit 31 to 24</brief>
                    <description>OB_BK1WP complement value bit 31 to 24</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[7:0]</name>
            <displayName>OB_USER1[7:0]</displayName>
            <addressOffset>0x18</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>value bit 7 to 0</name>
                    <brief>value bit 7 to 0</brief>
                    <description>value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[7:0]</name>
            <displayName>OB_USER1_N[7:0]</displayName>
            <addressOffset>0x19</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[7:0]</name>
                    <brief>OB_USER1 complement value bit 7 to 0</brief>
                    <description>OB_USER1 complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[15:8]</name>
            <displayName>OB_USER1[15:8]</displayName>
            <addressOffset>0x1A</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[15:8]</name>
                    <brief>OB_USER1 value bit 15 to 8</brief>
                    <description>OB_USER1 value bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[15:8]</name>
            <displayName>OB_USER1_N[15:8]</displayName>
            <addressOffset>0x1B</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[15:8]</name>
                    <brief>OB_USER1 complement value bit 15 to 8</brief>
                    <description>OB_USER1 complement value bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[23:16]</name>
            <displayName>OB_USER1[23:16]</displayName>
            <addressOffset>0x1C</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[23:16]</name>
                    <brief>OB_USER1 value bit 23 to 16</brief>
                    <description>OB_USER1 value bit 23 to 16</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[23:16]</name>
            <displayName>OB_USER1_N[23:16]</displayName>
            <addressOffset>0x1D</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[23:16]</name>
                    <brief>OB_USER1 complement value bit 23 to 16</brief>
                    <description>OB_USER1 complement value bit 23 to 16</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1[31:24]</name>
            <displayName>OB_USER1[31:24]</displayName>
            <addressOffset>0x1E</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_USER1[31:24]</name>
                    <brief>OB_USER1 value bit 31 to 24</brief>
                    <description>OB_USER1 value bit 31 to 24</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER1_N[31:24]</name>
            <displayName>OB_USER1_N[31:24]</displayName>
            <addressOffset>0x1F</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER1_N[31:24]</name>
                    <brief>OB_USER1 complement value bit 31 to 24</brief>
                    <description>OB_USER1 complement value bit 31 to 24</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
