light-136/GitCC/GD32驱动器/GD32固件烧录/GD32 All In One Programmer/OptionBytesXML/GD32A72x.xml
                </field>
                <field>
                    <name>nRST_DPSLP</name>
                    <brief>nRST_DPSLP</brief>
                    <description>nRST_DPSLP&#x000A;0: generate a reset instead of entering deep-sleep mode&#x000A;1: no reset when entering deep-sleep mode</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>nFWDG0_HW</name>
                    <brief>nFWDG0_HW</brief>
                    <description>nFWDG0_HW&#x000A;0: hardware free watchdog 0&#x000A;1: software free watchdog 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_USER_N</name>
            <displayName>OB_USER_N</displayName>
            <addressOffset>0x3</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_USER_N</name>
                    <brief>OB_USER complement value</brief>
                    <description>OB_USER complement value</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_DATA[7:0]</name>
            <displayName>OB_DATA[7:0]</displayName>
            <addressOffset>0x4</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_DATA[7:0]</name>
                    <brief>user defined data bit 7 to 0</brief>
                    <description>user defined data bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_DATA_N[7:0]</name>
            <displayName>OB_DATA_N[7:0]</displayName>
            <addressOffset>0x5</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_DATA_N[7:0]</name>
                    <brief>OB_DATA complement value bit 7 to 0</brief>
                    <description>OB_DATA complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_DATA[15:8]</name>
            <displayName>OB_DATA[15:8]</displayName>
            <addressOffset>0x6</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_DATA[15:8]</name>
                    <brief>user defined data bit 15 to 8</brief>
                    <description>user defined data bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_DATA_N[15:8]</name>
            <displayName>OB_DATA_N[15:8]</displayName>
            <addressOffset>0x7</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_DATA_N[15:8]</name>
                    <brief>OB_DATA complement value bit 15 to 8</brief>
                    <description>OB_DATA complement value bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP[7:0]</name>
            <displayName>OB_BK0WP[7:0]</displayName>
            <addressOffset>0x8</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK0WP[7]</name>
                    <brief>0x8038000~0x803FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 7(0x8038000~0x803FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[6]</name>
                    <brief>0x8030000~0x8037FFF</brief>
                    <description>Page erase / program protection of bank0 bit 6(0x8030000~0x8037FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[5]</name>
                    <brief>0x8028000~0x802FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 5(0x8028000~0x802FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[4]</name>
                    <brief>0x8020000~0x8027FFF</brief>
                    <description>Page erase / program protection of bank0 bit 4(0x8020000~0x8027FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[3]</name>
                    <brief>0x8018000~0x801FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 3(0x8018000~0x801FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[2]</name>
                    <brief>0x8010000~0x8017FFF</brief>
                    <description>Page erase / program protection of bank0 bit 2(0x8010000~0x8017FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[1]</name>
                    <brief>0x8008000~0x800FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 1(0x8008000~0x800FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[0]</name>
                    <brief>0x8000000~0x8007FFF</brief>
                    <description>Page erase / program protection of bank0 bit 0(0x8000000~0x8007FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP_N[7:0]</name>
            <displayName>OB_BK0WP_N[7:0]</displayName>
            <addressOffset>0x9</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK0WP_N[7:0]</name>
                    <brief>OB_BK0WP complement value bit 7 to 0</brief>
                    <description>OB_BK0WP complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP[15:8]</name>
            <displayName>OB_BK0WP[15:8]</displayName>
            <addressOffset>0xA</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK0WP[15]</name>
                    <brief>0x8078000~0x807FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 15(0x8078000~0x807FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[14]</name>
                    <brief>0x8070000~0x8077FFF</brief>
                    <description>Page erase / program protection of bank0 bit 14(0x8070000~0x8077FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[13]</name>
                    <brief>0x8068000~0x806FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 13(0x8068000~0x806FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[12]</name>
                    <brief>0x8060000~0x8067FFF</brief>
                    <description>Page erase / program protection of bank0 bit 12(0x8060000~0x8067FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[11]</name>
                    <brief>0x8058000~0x805FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 11(0x8058000~0x805FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[10]</name>
                    <brief>0x8050000~0x8057FFF</brief>
                    <description>Page erase / program protection of bank0 bit 10(0x8050000~0x8057FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[9]</name>
                    <brief>0x8048000~0x804FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 9(0x8048000~0x804FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[8]</name>
                    <brief>0x8040000~0x8047FFF</brief>
                    <description>Page erase / program protection of bank0 bit 8(0x8040000~0x8047FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP_N[15:8]</name>
            <displayName>OB_BK0WP_N[15:8]</displayName>
            <addressOffset>0xB</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK0WP_N[15:8]</name>
                    <brief>OB_BK0WP complement value bit 15 to 8</brief>
                    <description>OB_BK0WP complement value bit 15 to 8</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP[23:16]</name>
            <displayName>OB_BK0WP[23:16]</displayName>
            <addressOffset>0xC</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK0WP[23]</name>
                    <brief>0x80B8000~0x80BFFFF</brief>
                    <description>Page erase / program protection of bank0 bit 23(0x80B8000~0x80BFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[22]</name>
                    <brief>0x80B0000~0x80B7FFF</brief>
                    <description>Page erase / program protection of bank0 bit 22(0x80B0000~0x80B7FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[21]</name>
                    <brief>0x80A8000~0x80AFFFF</brief>
                    <description>Page erase / program protection of bank0 bit 21(0x80A8000~0x80AFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[20]</name>
                    <brief>0x80A0000~0x80A7FFF</brief>
                    <description>Page erase / program protection of bank0 bit 20(0x80A0000~0x80A7FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[19]</name>
                    <brief>0x8098000~0x809FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 19(0x8098000~0x809FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[18]</name>
                    <brief>0x8090000~0x8097FFF</brief>
                    <description>Page erase / program protection of bank0 bit 18(0x8090000~0x8097FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[17]</name>
                    <brief>0x8088000~0x808FFFF</brief>
                    <description>Page erase / program protection of bank0 bit 17(0x8088000~0x808FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[16]</name>
                    <brief>0x8080000~0x8087FFF</brief>
                    <description>Page erase / program protection of bank0 bit 16(0x8080000~0x8087FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP_N[23:16]</name>
            <displayName>OB_BK0WP_N[23:16]</displayName>
            <addressOffset>0xD</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK0WP_N[23:16]</name>
                    <brief>OB_BK0WP complement value bit 23 to 16</brief>
                    <description>OB_BK0WP complement value bit 23 to 16</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP[31:24]</name>
            <displayName>OB_BK0WP[31:24]</displayName>
            <addressOffset>0xE</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK0WP[31]</name>
                    <brief>0x80F8000~0x80FFFFF</brief>
                    <description>Page erase / program protection of bank0 bit 31(0x80F8000~0x80FFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[30]</name>
                    <brief>0x80F0000~0x80F7FFF</brief>
                    <description>Page erase / program protection of bank0 bit 30(0x80F0000~0x80F7FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[29]</name>
                    <brief>0x80E8000~0x80EFFFF</brief>
                    <description>Page erase / program protection of bank0 bit 29(0x80E8000~0x80EFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[28]</name>
                    <brief>0x80E0000~0x80E7FFF</brief>
                    <description>Page erase / program protection of bank0 bit 28(0x80E0000~0x80E7FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[27]</name>
                    <brief>0x80D8000~0x80DFFFF</brief>
                    <description>Page erase / program protection of bank0 bit 27(0x80D8000~0x80DFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[26]</name>
                    <brief>0x80D0000~0x80D7FFF</brief>
                    <description>Page erase / program protection of bank0 bit 26(0x80D0000~0x80D7FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[25]</name>
                    <brief>0x80C8000~0x80CFFFF</brief>
                    <description>Page erase / program protection of bank0 bit 25(0x80C8000~0x80CFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK0WP[24]</name>
                    <brief>0x80C0000~0x80C7FFF</brief>
                    <description>Page erase / program protection of bank0 bit 24(0x80C0000~0x80C7FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK0WP_N[31:24]</name>
            <displayName>OB_BK0WP_N[31:24]</displayName>
            <addressOffset>0xF</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_BK0WP_N[31:24]</name>
                    <brief>OB_BK0WP complement value bit 31 to 24</brief>
                    <description>OB_BK0WP complement value bit 31 to 24</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_BK1WP[7:0]</name>
            <displayName>OB_BK1WP[7:0]</displayName>
            <addressOffset>0x10</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_BK1WP[7]</name>
                    <brief>0x8138000~0x813FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 7(0x8138000~0x813FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[6]</name>
                    <brief>0x8130000~0x8137FFF</brief>
                    <description>Page erase / program protection of bank1 bit 6(0x8130000~0x8137FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[5]</name>
                    <brief>0x8128000~0x812FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 5(0x8128000~0x812FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[4]</name>
                    <brief>0x8120000~0x8127FFF</brief>
                    <description>Page erase / program protection of bank1 bit 4(0x8120000~0x8127FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[3]</name>
                    <brief>0x8118000~0x811FFFF</brief>
                    <description>Page erase / program protection of bank1 bit 3(0x8118000~0x811FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_BK1WP[2]</name>
                    <brief>0x8110000~0x8117FFF</brief>
